'''

8. * Аквариум
За рождения си ден Любомир получил аквариум с формата на паралелепипед. Трябва да се пресметне колко
литра вода ще събира аквариума, ако се знае, че определен процент от вместимостта му е заета от пясък,
растения, нагревател и помпа. Размерите му – дължина, широчина и височина в сантиметри ще бъдат
въведени от конзолата.
Един литър вода се равнява на един кубичен дециметър/ 1л=1 дм 3 /.
Да се напише програма, която изчислява литрите вода, която са необходими за напълването на аквариума.
Вход
От конзолата се четат 4 реда:
1. Дължина в см – цяло число
2. Широчина в см – цяло число
3. Височина в см – цяло число
4. Процент зает обем – реално число

'''

lenght = int(input())
width = int(input())
height = int(input())
percentage_used_volume = float(input()) / 100

volume = lenght * width * height / 1000

used_space = volume * percentage_used_volume
needed_litres = volume - used_space

print(needed_litres)