'''
Задача 2. Добавяне на багаж
Мими има закупени самолетни билети, но в последствие решава да си добави багаж към тях.
Таксите за багаж се изчисляват въз основа на теглото на чекирания багаж:
•	до 10кг – 20% от цената на багаж над 20кг
•	между 10кг и 20кг вкл. – 50% от цената на багаж над 20кг.
•	над 20кг – таксата се чете от конзолата

В зависимост от броя на дните, които остават до пътуването, цената се оскъпява:
•	повече от 30 дни - цената на багажа се оскъпява с 10%
•	между 7 и 30 дни вкл. - цената на багажа се оскъпява с 15%
•	по-малко от 7 дни - цената на багажа се оскъпява с 40%

Напишете програма, която пресмята колко ще трябва да заплати Мими, спрямо горните условия.
Вход:
От конзолата се четат 4 реда:
1.	Цената на багаж над 20кг - реално число в диапазона [10.0…80.0]
2.	Килограми на багажа – реално число в диапазона [1.0…32.0]
3.	Дни до пътуването – цяло число в диапазона [1…60]
4.	Брой багажи – цяло число в диапазона [1…10]
Изход
Да се отпечата на конзолата сумата, която ще трябва да заплати Мими за багажите, в следния формат:
•	" The total price of bags is: {цената на багажите} lv. "
Сумата да бъде форматирана до втората цифра след десетичния знак.

'''

cost_baggage_20kg = float(input())
baggege_kg = float(input())
days_to_the_travel = int(input())
number_baggages = int(input())
cost_baggage = 0


if baggege_kg < 10:
    cost_baggage = 0.2* cost_baggage_20kg
elif baggege_kg >= 10 and baggege_kg <= 20:
    cost_baggage = 0.5 * cost_baggage_20kg
else:
    cost_baggage = cost_baggage_20kg

if days_to_the_travel > 30:
    cost_baggage = cost_baggage * 1.1
elif days_to_the_travel <= 30 and days_to_the_travel >= 7:
    cost_baggage = cost_baggage * 1.15
else:
    cost_baggage = cost_baggage * 1.4

print(f"The total price of bags is: {cost_baggage * number_baggages:.2f} lv.")