'''

Време + 15 минути

Да се напише програма, която чете час и минути от 24-часово денонощие, въведени от потребителя и изчислява колко ще е часът след 15 минути.
Резултатът да се отпечата във формат часове:минути. Часовете винаги са между 0 и 23, а минутите винаги са между 0 и 59.
Часовете се изписват с една или две цифри. Минутите се изписват винаги с по две цифри, с водеща нула, когато е необходимо.

Примерен вход и изход

вход

изход

'''

hours = int(input())
minutes = int(input())

minutes += 15
if minutes > 59:
    if hours < 22:
       hours += 1
       minutes -= 60
    else:
        hours = 0
        minutes -=60



if minutes < 10:
    print(f"{hours}:0{minutes}")
else:
    print(f"{hours}:{minutes}")
