'''Умната Лили
Лили вече е на n години. За всеки свой рожден ден тя получава подарък. За нечетните рождени дни (1, 3, 5...n) получава играчки,
а за всеки четен (2, 4, 6...n) получава пари. За втория рожден ден получава 10.00 лв, като сумата се увеличава с 10.00 лв, за всеки
следващ четен рожден ден (2 -> 10, 4 -> 20, 6 -> 3...и т.н.). През годините Лили тайно е спестявала парите. Братът на Лили,
в годините, които тя получава пари, взима по 1.00 лев от тях. Лили продала играчките, получени през годините, всяка за P лева и
добавила сумата към спестените пари. С парите искала да си купи пералня за X лева. Напишете програма, която да пресмята, колко пари
е събрала и дали ѝ стигат, за да си купи пералня.

Вход

Програмата прочита 3 числа, въведени от потребителя, на отделни редове:
Възрастта на Лили - цяло число;
Цената на пералнята - реално число;
Единична цена на играчка - цяло число.

'''

age = int(input())
price_washer = float(input())
toy_cost = float(input())
money = 0

toy_number = 0

for i in range(1,age+1) :

    if i%2 !=0 :
        toy_number +=1
    else:
        money= money +10*i/2-1

money = money + toy_number*toy_cost

if (money - price_washer) >= 0:
    print(f"Yes! { money - price_washer} ")
else:
    print(f"No! { price_washer -money } ")


